case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
9
(
(0 1 0)
(0 1 0)
(0 1 0)
(0 1 0)
(0 1 0)
(0 1 0)
(0 1 0)
(0 1 0)
(0 1 0)
)
;
boundaryField
{
    walls
    {
        type            noSlip;
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 1 0);
    }
    top
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 1 0);
    }
}


// ************************************************************************* //
