case/constant/bioBedProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      bioCloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

bedSettings
{
    gridOrigin (0 -0.1 0);

    gridVertex (0.41 0.31 0.01);
        
    gridSize 0.1;
}


particleProperties
{
    rhop0           1450;// add
    T0              338;// add
    Cp0             1500;// add
    kp0             0.13;// add
    epsilon0        0.8;//particle emissivity []
    f0              0.5;
    
    sphericity      0.8;
    
    moisture        0.098;
    
    ashContent      0.06; //char based, a constant char yield is required
    
    //wet
    wet_rhop           1450;// add
    wet_T0            338;// add
    wet_Cp0           1500;// add
    wet_kp0         0.13;// add
    wet_epsilon0        1;//
    wet_dp0           0.01;// add
//     wet_registeredRatio_
    
    //dry
    dry_rhop           1450;// add
    dry_T0            338;// add
    dry_Cp0           1500;// add
    dry_kp0         0.1;// add
    dry_epsilon0        1;//
    dry_dp0           0.01;// add
    
    //char
    char_rhop           1570;// add
    char_T0            338;// add
    char_Cp0           1100;// add
    char_kp0         0.06;// add
    char_epsilon0        1;//
    char_dp0           0.01;// add
    
    //ash
    ash_rhop           2000;// add
    ash_T0            338;// add
    ash_Cp0           1000;// add
    ash_kp0         0.4;// add
    ash_epsilon0        1;//
    ash_dp0           0.01;// add
    
    ashFixedPorosity    0.65;

    //particleNumber_e need to be initialized by patching
    
}

constantProperties
{
    TMin            273;
    pMin            1000;
    minParticleMass 1e-15;
    
    alphaMin        0.05;

    Pr              0.7;
    constantVolume  false; // add
    
    deltaTime 1e-4;
    
//     hCoeff 58;
}

collapseSetting
{
    collapseThreshold   0.5;
    collapseTo          0.4;
    collapseTolerance   0.02;
}

subModels
{
    radiation       on;
    
    MomentumSource explicit;
    
    HeatSource explicit;
    
    MassSource explicit;
    
    SpeciesSource explicit;
    
    integrationSchemes
    {
        Momentum        Euler;
        T               analytical;
    }
    
    particleForces
    {
        sphereDrag;
//         ErgunWenYuDrag
//         {
//             alphac alpha;
//         }
//         gravity;
    }

    
    heatTransferModel RanzMarshall;
    
    massTransferModel RanzMarshall;


    dryingModel liquidEvaporation;

    devolatilisationModel DiBlasiDevolatilisation;

    surfaceReactionModel COxidationKineticDiffusionLimitedRate;
    

    
    RanzMarshallCoeffs
    {
        BirdCorrection  false;
    }


    liquidEvaporationCoeffs
    {
        enthalpyTransfer enthalpyDifference;

        activeLiquids
        (
            H2O
        );
    }
    
    DiBlasiDevolatilisationCoeffs
    {
        // Wagenaar 1994
        devolKinetic1     (1.10E+11 1.77E+08 ); // (A1 E1 ) wood gas1
        devolKinetic2     (9.28E+09 1.49E+08 ); // (A2 E2 ) wood tar
        devolKinetic3     (3.05E+07 1.25E+08 ); // (A3 E3 ) wood char
        devolKinetic4	(4.28E+06 1.075E+08 ); // (A4 E4 ) tar light gas
        devolKinetic5	(1.0E+05  1.075E+08 ); // (A5 E5 ) tar char
        
        volgas //light gas
        (
            (H2O     0.2196 ) // (name weight_fraction)
            (H2     0.0047)   // (name weight_fraction )
            (CO      0.1270)   // (name weight_fraction)
            (CO2     0.2440)  // (name weight_fraction)
            (CH4     0.0355)   // (name weight_fraction)
            (tar     0.3692)   // (name weight_fraction)
        );
        
        residualCoeff   1E-06;
        
        secondReaction true;
    }
    
    COxidationKineticDiffusionLimitedRateCoeffs
    {
        Sb              1;
        C1              5.0E-12;
        C2              0.002;
        E               7.9E+07;
    }

    

    COxidationKineticDiffusionLimitedRateWithAshSteamCoeffs
    {
        COmiga        3390.0;// activation energy in omega function
        ep3            0.65;//porosity of ash layer
        C1_O2           2.03e-10;//mass diffusion constant
        C1_H2O           8.48e-10;//mass diffusion constant
        C1_CO2           5.37e-10;//mass diffusion constant
        C1_H2           2.60e-9;//mass diffusion constant
        C2_1            1.715;//- Kinetics limited rate pre-exponential constant, C2
        C2_2            3.42;//- Kinetics limited rate pre-exponential constant, C2
        C2_3            3.42;//- Kinetics limited rate pre-exponential constant, C2
        C2_4            3.42e-3;//- Kinetics limited rate pre-exponential constant, C2
        E1              9000.0;//- Kinetics limited rate activation energy RR together
        E2              15600.0;//- Kinetics limited rate activation energy RR together
        E3              15600.0;//- Kinetics limited rate activation energy RR together
        E4              15600.0;//- Kinetics limited rate activation energy RR together
      //C1              5.0E-12; //mass diffusion constant, same value for O2, CO2, and H2O
        AO2              2.51E-03;//pre-exponential factor
        AH2O              2.0E-03;
        ACO2              3.0E-01;
        EO2               7.48E+07; //activation energy
        EH2O               1.96E+08;
        ECO2               2.00E+08;
    }

}


cloudFunctions
{}


// ************************************************************************* //
