case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.3;

vertices
(
    (0 0   0)
    (1 0   0)
    (1 1   0)
    (0 1   0)
    (0 0   0.33)
    (1 0   0.33)
    (1 1   0.33)
    (0 1   0.33)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (3 3 1) simpleGrading (1 1 1)
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (0 1 5 4)
            
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (2 3 7 6)
        );
    }

    walls
    {
        type wall;
        faces
        (
            
            (4 5 6 7)
            
            (1 2 6 5)
            (3 0 4 7)
            (0 1 2 3)
        );
    }
);

// ************************************************************************* //
